//! HTTP - інструмент для обміну інформацією
//! HTTP - інструмент для обміну інформацією
//! HTTP - інструмент для обміну інформацією

//! HTTP: Дає можливість обмінюватися даними між клієнтом і сервером. Складається з елементів:
//! URL & params - URL - ваша адреса а параметри вже більш точніше...
//! API адреаса - адреса серверу в мережі. URL - те саме що IP адреса... URL обгортка над IP адресою...

//! http response
//! status code (100-500)
//! body
//! heder - heder є і в респонсі і в ....

//! REST API
//! Якщо сервер хоче обмінюватися даними із сторонніми розробниками...

//! API - це можливість серверу ділитися з вами даними. Не всі веб застосунки мають API.

//! Rest API - архітектура для проектування апішок!!!

//! Rest API використовує в собі HTTP - але це про різне - НЕ ПЛУТАЙТЕ!!!

//! РЕСУРС - це певна сутність (ентіті) з якою ви працюєте в межах рест апі.... Юзер абстракція...

//! REst API - архітектурний стиль для удобного обміну даними

//!SECTION


//! JSON - формат передачі даних
//! JSON - самий популярний... мало важить по памяті... Має вигляд ключ-значення...

//! Різниця між обьектом і JSON... 
//! Строковий формат даних...
/*
{
  "key": "value"
}
  */

//! HTTP
//! REST API
//! JSON
//! JavaScript objects

// - все це різні речі
// - все це різні речі
// - все це різні речі

//! GraphQL, RestAPI, WEB Socket - це види АПІШОК...
//! GraphQL, RestAPI, WEB Socket - це види АПІШОК...
//! GraphQL, RestAPI, WEB Socket - це види АПІШОК...

//! МИ обговорили з чого HTTP запит складається!


//! ===================================
//! ==============Тепер як його виконати=====================

//! Fetch - це інструмент здійснення запитів до серверу...
//! Fetch - це інструмент здійснення запитів до серверу...

//! Postman - це теж інструмент здійснення запитів до серверу...
//! Postman - це теж інструмент здійснення запитів до серверу...

//! 400 - щось з вашим запитом
//! 500 - сервер

//! ЗАПИТЫВ ПОВИННО БУТИ МАЛО НАСТІЛЬКИ МОЖНА

//! QUERY PARAMS - https://5e5cf5eb97d2ea0014796f01.mockapi.io/api/v1/users?city=Kyiv
//! QUERY PARAMS - ДЛЯ ФІЛЬТРАЦІЇ - до 5 максимум

//! ?city=Kyiv
//! ?city=Kyiv&searchStr=a


